#!/usr/bin/env python3
# -*- coding: utf-8 -*-

if __name__ == '__main__':
    print('Введите координаты точки M1')
    x1 = int(input('x2 = '))
    y1 = int(input('y2 = '))

    print('Введите координаты точки M2')
    x2 = int(input('x2 = '))
    y2 = int(input('y2 = '))

    if x1 == x2:
        if y1 + y2 == 0:
            print('Точки M1 и M2 симметричны относительно начала координат')
    elif y1 == y2:
        if x1 + x2 == 0:
            print('Точки M1 и M2 симметричны относительно начала координат')
    else:
        print('Точки не симметричны относительно начала координат')
